-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 02 2020 г., 10:49
-- Версия сервера: 8.0.19
-- Версия PHP: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `employees`
--

CREATE TABLE `employees` (
  `id` int NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `employees`
--

INSERT INTO `employees` (`id`, `name`) VALUES
(1, 'John'),
(2, 'Alex'),
(3, 'Peter'),
(4, 'Nick'),
(5, 'Elon'),
(6, 'Bill'),
(7, 'Fred'),
(8, 'Jack'),
(9, 'Kate'),
(10, 'Ann'),
(11, 'Lily'),
(12, 'Jessica'),
(13, 'Olivia');

-- --------------------------------------------------------

--
-- Структура таблицы `time_reports`
--

CREATE TABLE `time_reports` (
  `id` int NOT NULL,
  `employee_id` int NOT NULL,
  `hours` float NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `time_reports`
--

INSERT INTO `time_reports` (`id`, `employee_id`, `hours`, `date`) VALUES
(1, 1, 5, '2020-09-21'),
(2, 2, 1, '2020-09-21'),
(3, 3, 5, '2020-09-21'),
(4, 4, 6, '2020-09-21'),
(5, 5, 1, '2020-09-21'),
(6, 6, 3, '2020-09-21'),
(7, 7, 3, '2020-09-21'),
(8, 8, 1, '2020-09-21'),
(9, 9, 2, '2020-09-21'),
(10, 10, 0, '2020-09-21'),
(11, 11, 3, '2020-09-21'),
(12, 12, 6, '2020-09-21'),
(13, 13, 6.35, '2020-09-21'),
(14, 1, 0, '2020-09-22'),
(15, 2, 0, '2020-09-22'),
(16, 3, 4, '2020-09-22'),
(17, 4, 1, '2020-09-22'),
(18, 5, 5, '2020-09-22'),
(19, 6, 4, '2020-09-22'),
(20, 7, 7, '2020-09-22'),
(21, 8, 1, '2020-09-22'),
(22, 9, 5, '2020-09-22'),
(23, 10, 1, '2020-09-22'),
(24, 11, 6, '2020-09-22'),
(25, 12, 3, '2020-09-22'),
(26, 13, 4, '2020-09-22'),
(27, 1, 3, '2020-09-23'),
(28, 2, 3, '2020-09-23'),
(29, 3, 1, '2020-09-23'),
(30, 4, 2, '2020-09-23'),
(31, 5, 7, '2020-09-23'),
(32, 6, 6, '2020-09-23'),
(33, 7, 2, '2020-09-23'),
(34, 8, 7, '2020-09-23'),
(35, 9, 5, '2020-09-23'),
(36, 10, 5, '2020-09-23'),
(37, 11, 2, '2020-09-23'),
(38, 12, 5, '2020-09-23'),
(39, 13, 5, '2020-09-23'),
(40, 1, 4, '2020-09-24'),
(41, 2, 7, '2020-09-24'),
(42, 3, 0, '2020-09-24'),
(43, 4, 6, '2020-09-24'),
(44, 5, 3, '2020-09-24'),
(45, 6, 1, '2020-09-24'),
(46, 7, 3, '2020-09-24'),
(47, 8, 5, '2020-09-24'),
(48, 9, 0, '2020-09-24'),
(49, 10, 3, '2020-09-24'),
(50, 11, 1, '2020-09-24'),
(51, 12, 1, '2020-09-24'),
(52, 13, 3, '2020-09-24'),
(53, 1, 1, '2020-09-25'),
(54, 2, 5, '2020-09-25'),
(55, 3, 4, '2020-09-25'),
(56, 4, 6, '2020-09-25'),
(57, 5, 3, '2020-09-25'),
(58, 6, 7, '2020-09-25'),
(59, 7, 0, '2020-09-25'),
(60, 8, 6, '2020-09-25'),
(61, 9, 6, '2020-09-25'),
(62, 10, 3, '2020-09-25'),
(63, 11, 5, '2020-09-25'),
(64, 12, 3, '2020-09-25'),
(65, 13, 6, '2020-09-25'),
(100, 1, 4, '2020-09-28'),
(101, 2, 0, '2020-09-28'),
(102, 3, 3, '2020-09-28'),
(103, 4, 1, '2020-09-28'),
(104, 5, 2, '2020-09-28'),
(105, 6, 2, '2020-09-28'),
(106, 7, 6, '2020-09-28'),
(107, 8, 5, '2020-09-28'),
(108, 9, 1, '2020-09-28'),
(109, 10, 7, '2020-09-28'),
(110, 11, 1, '2020-09-28'),
(111, 12, 0, '2020-09-28'),
(112, 13, 7, '2020-09-28'),
(113, 1, 6, '2020-09-29'),
(114, 2, 6, '2020-09-29'),
(115, 3, 7, '2020-09-29'),
(116, 4, 1, '2020-09-29'),
(117, 5, 0, '2020-09-29'),
(118, 6, 7, '2020-09-29'),
(119, 7, 1, '2020-09-29'),
(120, 8, 0, '2020-09-29'),
(121, 9, 6, '2020-09-29'),
(122, 10, 6, '2020-09-29'),
(123, 11, 5, '2020-09-29'),
(124, 12, 7, '2020-09-29'),
(125, 13, 6, '2020-09-29'),
(126, 1, 7, '2020-09-30'),
(127, 2, 4, '2020-09-30'),
(128, 3, 1, '2020-09-30'),
(129, 4, 2, '2020-09-30'),
(130, 5, 4, '2020-09-30'),
(131, 6, 1, '2020-09-30'),
(132, 7, 3, '2020-09-30'),
(133, 8, 3, '2020-09-30'),
(134, 9, 5, '2020-09-30'),
(135, 10, 1, '2020-09-30'),
(136, 11, 0, '2020-09-30'),
(137, 12, 4, '2020-09-30'),
(138, 13, 3, '2020-09-30'),
(139, 1, 1, '2020-10-01'),
(140, 2, 5, '2020-10-01'),
(141, 3, 6, '2020-10-01'),
(142, 4, 0, '2020-10-01'),
(143, 5, 5, '2020-10-01'),
(144, 6, 4, '2020-10-01'),
(145, 7, 5, '2020-10-01'),
(146, 8, 4, '2020-10-01'),
(147, 9, 6, '2020-10-01'),
(148, 10, 5, '2020-10-01'),
(149, 11, 4, '2020-10-01'),
(150, 12, 7, '2020-10-01'),
(151, 13, 1, '2020-10-01');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `time_reports`
--
ALTER TABLE `time_reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `employees`
--
ALTER TABLE `employees`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `time_reports`
--
ALTER TABLE `time_reports`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=153;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `time_reports`
--
ALTER TABLE `time_reports`
  ADD CONSTRAINT `time_reports_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
